# Реализовать класс Road (дорога), в котором определить атрибуты: length (длина), width (ширина). Значения данных атрибутов должны передаваться при создании экземпляра класса.
# Атрибуты сделать защищенными. Определить метод расчета массы асфальта, необходимого для покрытия всего дорожного полотна.
# Использовать формулу: длинаширинамасса асфальта для покрытия одного кв метра дороги асфальтом, толщиной в 1 см*число см толщины полотна. Проверить работу метода.
# Например: 20м*5000м*25кг*5см = 12500 т

class Road:
    def __init__(self, length, width):
        self._lenght = length
        self._width = width

    __consistence = 5  # Кг/ м^2

    def asphalt_mass(self, depth):
        return self._lenght * self._width * self.__consistence * depth


my_road = Road(10000, 25)

print(
    f'Для прокладки дороги длинной {my_road._lenght} м. и щириной {my_road._width} м. с толщиной полотна 5 см требуется  {my_road.asphalt_mass(5) / 1000:.0f} т асфальта')
